; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v11 ?v1)
             (pred_1 ?v4 ?v6)
             (pred_11 ?v11 ?v6)
             (pred_6 ?v2 ?v11 )
	     (pred_2 ?v11)
             (pred_12 ?v9)
             (pred_5 ?v4)
             (pred_4 ?v6)
             (pred_9 ?v11)
             (pred_7 ?v4)
             (pred_3 ?v11)
             (pred_8 ))



(:action op_3
:parameters (?v8 ?v5 ?v10 ?v3)
:precondition (and (pred_12 ?v8) (pred_12 ?v5) (pred_5 ?v10) (pred_4 ?v3)
          (pred_10 ?v8 ?v5) (pred_1 ?v10 ?v3)
                   (pred_11 ?v5 ?v3) (pred_2 ?v8) 
                   (pred_9 ?v5) (pred_7 ?v10))
:effect (and  (pred_3 ?v5) (not (pred_9 ?v5))))


(:action op_5
:parameters (?v8 ?v13)
:precondition (and (pred_12 ?v8) (pred_12 ?v13)
               (pred_2 ?v8) (pred_10 ?v8 ?v13) (pred_3 ?v13))
:effect (and (pred_2 ?v13) (not (pred_2 ?v8))))

(:action op_4
:parameters (?v8 ?v10)
:precondition (and (pred_12 ?v8) (pred_5 ?v10) 
                  (pred_2 ?v8) (pred_6 ?v10 ?v8) (pred_8 ))
:effect (and (pred_7 ?v10)
   (not (pred_6 ?v10 ?v8)) (not (pred_8 ))))


(:action op_1
:parameters (?v8 ?v7 ?v12)
:precondition (and (pred_12 ?v8) (pred_5 ?v7) (pred_5 ?v12)
                  (pred_2 ?v8) (pred_7 ?v12) (pred_6 ?v7 ?v8))
:effect (and (pred_7 ?v7) (pred_6 ?v12 ?v8)
        (not (pred_7 ?v12)) (not (pred_6 ?v7 ?v8))))

(:action op_2
:parameters (?v8 ?v10)
:precondition (and (pred_12 ?v8) (pred_5 ?v10) 
                  (pred_2 ?v8) (pred_7 ?v10))
:effect (and (pred_8 ) (pred_6 ?v10 ?v8) (not (pred_7 ?v10)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_11 obj_16 obj_07 obj_03 obj_01 obj_04 obj_05 obj_08 obj_18 obj_19 obj_02 obj_13 obj_09 obj_20 obj_06 obj_10
    obj_17 obj_15
    obj_12 obj_14
    )

    (:init
       (pred_8)

       (pred_12 obj_11)
       (pred_12 obj_16)
       (pred_12 obj_07)
       (pred_12 obj_03)
       (pred_12 obj_01)
       (pred_12 obj_04)
       (pred_12 obj_05)
       (pred_12 obj_08)
       (pred_12 obj_18)
       (pred_12 obj_19)
       (pred_12 obj_02)
       (pred_12 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_20)
       (pred_12 obj_06)
       (pred_12 obj_10)
       (pred_4 obj_17)
       (pred_4 obj_15)
       (pred_5 obj_12)
       (pred_5 obj_14)

       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_16)
       (pred_10 obj_16 obj_04)
       (pred_10 obj_16 obj_07)
       (pred_10 obj_16 obj_11)
       (pred_10 obj_07 obj_05)
       (pred_10 obj_07 obj_03)
       (pred_10 obj_07 obj_16)
       (pred_10 obj_03 obj_08)
       (pred_10 obj_03 obj_07)
       (pred_10 obj_01 obj_18)
       (pred_10 obj_01 obj_04)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_04 obj_19)
       (pred_10 obj_04 obj_05)
       (pred_10 obj_04 obj_16)
       (pred_10 obj_04 obj_01)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_08)
       (pred_10 obj_05 obj_07)
       (pred_10 obj_05 obj_04)
       (pred_10 obj_08 obj_13)
       (pred_10 obj_08 obj_03)
       (pred_10 obj_08 obj_05)
       (pred_10 obj_18 obj_09)
       (pred_10 obj_18 obj_19)
       (pred_10 obj_18 obj_01)
       (pred_10 obj_19 obj_20)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_04)
       (pred_10 obj_19 obj_18)
       (pred_10 obj_02 obj_06)
       (pred_10 obj_02 obj_13)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_08)
       (pred_10 obj_13 obj_02)
       (pred_10 obj_09 obj_20)
       (pred_10 obj_09 obj_18)
       (pred_10 obj_20 obj_06)
       (pred_10 obj_20 obj_19)
       (pred_10 obj_20 obj_09)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_06 obj_02)
       (pred_10 obj_06 obj_20)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_06)
       (pred_9 obj_20)
       (pred_9 obj_05)
       (pred_11  obj_20 obj_17)
       (pred_11  obj_05 obj_15)
       (pred_3 obj_11)
       (pred_3 obj_16)
       (pred_3 obj_07)
       (pred_3 obj_03)
       (pred_3 obj_01)
       (pred_3 obj_04)
       (pred_3 obj_08)
       (pred_3 obj_18)
       (pred_3 obj_19)
       (pred_3 obj_02)
       (pred_3 obj_13)
       (pred_3 obj_09)
       (pred_3 obj_06)
       (pred_3 obj_10)

       (pred_1  obj_12 obj_17)
       (pred_1  obj_14 obj_15)
       (pred_6 obj_12 obj_04)
       (pred_6 obj_14 obj_13)
       (pred_2 obj_18)
    )

    (:goal (and
       (pred_6 obj_14 obj_01)
    ))
(:constraints
  (always (not (pred_2 obj_02)))
)
)

; plan
1. (op_5 obj_18 obj_01)
   deleted: (pred_2 obj_18)
   added: (pred_2 obj_01)
   goals met: 0 of 1
2. (op_5 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 0 of 1
3. (op_4 obj_04 obj_12)
   deleted: (pred_6 obj_12 obj_04) (pred_8)
   added: (pred_7 obj_12)
   goals met: 0 of 1
4. (op_5 obj_04 obj_19)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_19)
   goals met: 0 of 1
5. (op_3 obj_19 obj_20 obj_12 obj_17)
   deleted: (pred_9 obj_20)
   added: (pred_3 obj_20)
   goals met: 0 of 1
6. (op_5 obj_19 obj_04)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_04)
   goals met: 0 of 1
7. (op_5 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 0 of 1
8. (op_2 obj_01 obj_12)
   deleted: (pred_7 obj_12)
   added: (pred_8) (pred_6 obj_12 obj_01)
   goals met: 0 of 1
9. (op_5 obj_01 obj_04)
   deleted: (pred_2 obj_01)
   added: (pred_2 obj_04)
   goals met: 0 of 1
10. (op_5 obj_04 obj_19)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_19)
   goals met: 0 of 1
11. (op_5 obj_19 obj_20)
   deleted: (pred_2 obj_19)
   added: (pred_2 obj_20)
   goals met: 0 of 1
12. (op_5 obj_20 obj_06)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_06)
   goals met: 0 of 1
13. (op_5 obj_06 obj_10)
   deleted: (pred_2 obj_06)
   added: (pred_2 obj_10)
   goals met: 0 of 1
14. (op_5 obj_10 obj_13)
   deleted: (pred_2 obj_10)
   added: (pred_2 obj_13)
   goals met: 0 of 1
15. (op_4 obj_13 obj_14)
   deleted: (pred_6 obj_14 obj_13) (pred_8)
   added: (pred_7 obj_14)
   goals met: 0 of 1
16. (op_5 obj_13 obj_08)
   deleted: (pred_2 obj_13)
   added: (pred_2 obj_08)
   goals met: 0 of 1
17. (op_3 obj_08 obj_05 obj_14 obj_15)
   deleted: (pred_9 obj_05)
   added: (pred_3 obj_05)
   goals met: 0 of 1
18. (op_5 obj_08 obj_05)
   deleted: (pred_2 obj_08)
   added: (pred_2 obj_05)
   goals met: 0 of 1
19. (op_5 obj_05 obj_04)
   deleted: (pred_2 obj_05)
   added: (pred_2 obj_04)
   goals met: 0 of 1
20. (op_5 obj_04 obj_01)
   deleted: (pred_2 obj_04)
   added: (pred_2 obj_01)
   goals met: 0 of 1
21. (op_1 obj_01 obj_12 obj_14)
   deleted: (pred_7 obj_14) (pred_6 obj_12 obj_01)
   added: (pred_7 obj_12) (pred_6 obj_14 obj_01)
   goals met: 1 of 1
